<a href="https://colab.research.google.com/github/FGalvao77/others-knowledge-in-python-for-data-science/blob/main/Uso_do_group_by.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# importando as biblioteca
import pandas as pd
import numpy as np

In [2]:
# criando um dicionário de lista
data = {
    'Sede': ['SP', 'SP', 'MG', 'MG', 'RJ', 'RJ', 
             'ES', 'ES'],
    'Vendedor': ['Jorge', 'Ana', 'Tiago', 'Pedro', 
                 'Raphaela', 'Gustavo', 'Maria', 
                 'Carolina'],
    'Vendas': [2000, 2500, 3100, 1200, 1500, 
               3900, 2900, 3900]
}

In [3]:
# através do dicionário de lista criando um dataframe
df = pd.DataFrame(data)
df

  Sede  Vendedor  Vendas
0   SP     Jorge    2000
1   SP       Ana    2500
2   MG     Tiago    3100
3   MG     Pedro    1200
4   RJ  Raphaela    1500
5   RJ   Gustavo    3900
6   ES     Maria    2900
7   ES  Carolina    3900

In [4]:
# agrupando por região
df.groupby('Sede')

In [5]:
# visualizar o agrupamento
by_sede = df.groupby('Sede')

In [6]:
# visualizando os vendedores com maior venda
by_sede.max()

      Vendedor  Vendas
Sede
ES       Maria    3900
MG       Tiago    3100
RJ    Raphaela    3900
SP       Jorge    2500

In [7]:
# visualizando a média de vendas por sede
by_sede.mean()

      Vendas
Sede
ES      3400
MG      2150
RJ      2700
SP      2250

In [8]:
# dados estatísticos
by_sede.describe()

     Vendas
      count    mean          std     min     25%     50%     75%     max
Sede
ES      2.0  3400.0   707.106781  2900.0  3150.0  3400.0  3650.0  3900.0
MG      2.0  2150.0  1343.502884  1200.0  1675.0  2150.0  2625.0  3100.0
RJ      2.0  2700.0  1697.056275  1500.0  2100.0  2700.0  3300.0  3900.0
SP      2.0  2250.0   353.553391  2000.0  2125.0  2250.0  2375.0  2500.0

In [9]:
# dados estatísticos
by_sede.describe().transpose()

Sede                   ES           MG           RJ           SP
Vendas count     2.000000     2.000000     2.000000     2.000000
       mean   3400.000000  2150.000000  2700.000000  2250.000000
       std     707.106781  1343.502884  1697.056275   353.553391
       min    2900.000000  1200.000000  1500.000000  2000.000000
       25%    3150.000000  1675.000000  2100.000000  2125.000000
       50%    3400.000000  2150.000000  2700.000000  2250.000000
       75%    3650.000000  2625.000000  3300.000000  2375.000000
       max    3900.000000  3100.000000  3900.000000  2500.000000

In [10]:
# dados estatísticos
by_sede.describe().T

Sede                   ES           MG           RJ           SP
Vendas count     2.000000     2.000000     2.000000     2.000000
       mean   3400.000000  2150.000000  2700.000000  2250.000000
       std     707.106781  1343.502884  1697.056275   353.553391
       min    2900.000000  1200.000000  1500.000000  2000.000000
       25%    3150.000000  1675.000000  2100.000000  2125.000000
       50%    3400.000000  2150.000000  2700.000000  2250.000000
       75%    3650.000000  2625.000000  3300.000000  2375.000000
       max    3900.000000  3100.000000  3900.000000  2500.000000

In [11]:
# dados estatísticos por  uma coluna específica
by_sede.describe().transpose()['SP']

Vendas  count       2.000000
        mean     2250.000000
        std       353.553391
        min      2000.000000
        25%      2125.000000
        50%      2250.000000
        75%      2375.000000
        max      2500.000000
Name: SP, dtype: float64

In [12]:
# dados estatísticos por  uma coluna específica
by_sede.describe().T['SP']

Vendas  count       2.000000
        mean     2250.000000
        std       353.553391
        min      2000.000000
        25%      2125.000000
        50%      2250.000000
        75%      2375.000000
        max      2500.000000
Name: SP, dtype: float64

In [92]:
# instanciando novos dados para criar um dataframe multi-indexes
arrays = [['São Paulo', 'São Paulo', 
           'Rio de Janeiro', 'Rio de Janeiro', 
           'Minas Gerais', 'Minas Gerais'], 
          ['Garrafas', 'Copos', 'Garrafas', 'Copos', 
           'Garrafas', 'Copos']]

indexes = pd.MultiIndex.from_arrays(arrays, names=('Estado', 'Produto'))

df = pd.DataFrame({'Total vendido R$': [10000, 35000, 22400, 12890, 13900, 23751]}, index=indexes)

df

                         Total vendido R$
Estado         Produto
São Paulo      Garrafas             10000
               Copos                35000
Rio de Janeiro Garrafas             22400
               Copos                12890
Minas Gerais   Garrafas             13900
               Copos                23751

In [93]:
arrays = [['São Paulo', 'São Paulo', 
           'Rio de Janeiro', 'Rio de Janeiro', 
           'Minas Gerais', 'Minas Gerais'], 
          ['Garrafas', 'Copos', 'Garrafas', 'Copos', 
           'Garrafas', 'Copos']]

In [94]:
indexes = pd.MultiIndex.from_arrays(arrays, names=('Estado', 'Produto'))

In [96]:
df1 = pd.DataFrame({'Total vendido R$': [10000, 35000, 22400, 
                                         12890, 13900, 23751]}, index=indexes)

In [97]:
df1

                         Total vendido R$
Estado         Produto
São Paulo      Garrafas             10000
               Copos                35000
Rio de Janeiro Garrafas             22400
               Copos                12890
Minas Gerais   Garrafas             13900
               Copos                23751

In [98]:
# realizando agrupamento por "estado"
by_estado = df1.groupby('Estado', level=0)
by_estado.describe().T

Estado                  Minas Gerais  Rio de Janeiro    São Paulo
Total vendido R$ count      2.000000        2.000000      2.00000
                 mean   18825.500000    17645.000000  22500.00000
                 std     6965.708901     6724.585489  17677.66953
                 min    13900.000000    12890.000000  10000.00000
                 25%    16362.750000    15267.500000  16250.00000
                 50%    18825.500000    17645.000000  22500.00000
                 75%    21288.250000    20022.500000  28750.00000
                 max    23751.000000    22400.000000  35000.00000

In [99]:
by_estado.mean()

                Total vendido R$
Estado
Minas Gerais             18825.5
Rio de Janeiro           17645.0
São Paulo                22500.0

In [100]:
by_produto = df1.groupby('Produto', level=1)

In [101]:
by_produto.mean()

          Total vendido R$
Produto
Copos         23880.333333
Garrafas      15433.333333

In [2]:
# importando as biblioteca
import pandas as pd
import numpy as np

In [4]:
# criando um dicionário de lista
dados = {
        'Nome': ['Jose', 'Maria', 'Paulo', 'Roberto', 'Franciele',
             'Jairo', 'Luciana', 'Camila', 'Jonas', 'Marcio'],
        'Idade': [25, 33, 18, 49, 65, 
                  57, 36, 22, 41, 21],
        'Sexo': ['M', 'F', 'M', 'M', 'F', 
                 'M', 'F', 'F', 'M', 'M'],
        'Estado': ['SP', 'RJ', 'PR', 'SP', 'RJ',
                   'RJ', 'MG', 'MG', 'SP', 'BA'],
        'Vendas': [1800, 2750, 2157, 3081, 2325,
                   3514, 2114, 4129, 1956, 2923]
}

In [6]:
# através do dicionário de lista criando um dataframe
df_vendedores = pd.DataFrame(dados)
df_vendedores.head()

        Nome  Idade Sexo Estado  Vendas
0       Jose     25    M     SP    1800
1      Maria     33    F     RJ    2750
2      Paulo     18    M     PR    2157
3    Roberto     49    M     SP    3081
4  Franciele     65    F     RJ    2325

In [7]:
# dimensão do dataframe
df_vendedores.shape

(10, 5)

In [8]:
# dados estatísticos
df_vendedores.describe()

           Idade       Vendas
count  10.000000    10.000000
mean   36.700000  2674.900000
std    16.145519   748.192852
min    18.000000  1800.000000
25%    22.750000  2124.750000
50%    34.500000  2537.500000
75%    47.000000  3041.500000
max    65.000000  4129.000000

In [104]:
# dados estatísticos
df_vendedores.describe(include='all').T

       count unique     top freq    mean  ...   min      25%     50%     75%   max
Nome      10     10  Camila    1     NaN  ...   NaN      NaN     NaN     NaN   NaN
Idade     10    NaN     NaN  NaN    36.7  ...    18    22.75    34.5      47    65
Sexo      10      2       M    6     NaN  ...   NaN      NaN     NaN     NaN   NaN
Estado    10      5      SP    3     NaN  ...   NaN      NaN     NaN     NaN   NaN
Vendas    10    NaN     NaN  NaN  2674.9  ...  1800  2124.75  2537.5  3041.5  4129

[5 rows x 11 columns]

In [105]:
# maior venda
print(df_vendedores.Vendas.max())

4129

In [119]:
maiores_vendas_valor = df_vendedores.groupby(by='Vendas')
maiores_vendas_valor.max()

             Nome  Idade Sexo Estado
Vendas
1800         Jose     25    M     SP
1956        Jonas     41    M     SP
2114      Luciana     36    F     MG
2157        Paulo     18    M     PR
2325    Franciele     65    F     RJ
2750        Maria     33    F     RJ
2923       Marcio     21    M     BA
3081      Roberto     49    M     SP
3514        Jairo     57    M     RJ
4129       Camila     22    F     MG

In [120]:
maiores_vendas_nome = df_vendedores.groupby(by='Nome')
maiores_vendas_nome.max()

           Idade Sexo Estado  Vendas
Nome
Camila        22    F     MG    4129
Franciele     65    F     RJ    2325
Jairo         57    M     RJ    3514
Jonas         41    M     SP    1956
Jose          25    M     SP    1800
Luciana       36    F     MG    2114
Marcio        21    M     BA    2923
Maria         33    F     RJ    2750
Paulo         18    M     PR    2157
Roberto       49    M     SP    3081

In [121]:
distribuicao_idade = df_vendedores.groupby('Idade').sum()
distribuicao_idade

       Vendas
Idade
18       2157
21       2923
22       4129
25       1800
33       2750
36       2114
41       1956
49       3081
57       3514
65       2325

In [122]:
df_vendedores.groupby(level=0).sum().mean()

Idade       36.7
Vendas    2674.9
dtype: float64

In [123]:
df_vendedores.groupby(level=0).sum()

   Idade  Vendas
0     25    1800
1     33    2750
2     18    2157
3     49    3081
4     65    2325
5     57    3514
6     36    2114
7     22    4129
8     41    1956
9     21    2923

In [124]:
maiores_vendas_estado = df_vendedores.groupby(by='Estado')
maiores_vendas_estado.mean()

            Idade  Vendas
Estado
BA      21.000000  2923.0
MG      29.000000  3121.5
PR      18.000000  2157.0
RJ      51.666667  2863.0
SP      38.333333  2279.0

In [125]:
media_vendas_sexo = df_vendedores.groupby(by='Sexo')
media_vendas_sexo.mean()

          Idade       Vendas
Sexo
F     39.000000  2829.500000
M     35.166667  2571.833333